const M = module.exports = {
  xi: 0, yi:1, zi:2,
  Pi: Math.PI,      // 圓周率
  G : 6.6742867e-11,// m3kg-1s-2 重力常數
  C : 2.99792458e8, // ms-1
  H : 1.05457162853e-34, // J, 約化的普朗克常數
  Ke: 8.98755e9,    // N m2 c-2   庫倫常數
  e:  1.60217648740e-19, // C, 單一電子電量 (庫倫)
  eV: 1.60217662e-19, // J, 電子伏特 = eV 焦耳 (能量單位)
  AU: 1.49597870660e11, // m, 天文單位，地球軌道半徑徑
  pc: 3.08567758074e16, // m, 秒差距，一A張角一角秒的距離
  kB: 1.380650424e23, // J/K, 波茲曼常數 = 8.617e-5 eV/K
  NA: 6.0221417930e23, // mol, 一莫耳的原子數(亞佛加蕨常數)
}

let {xi, Pi, G, C, H, Ke, eV, AU, pc, NA} = M

M.u = 0.001/NA // 1g/NA, 原子質量單位=碳 12 質量的 1/12, = 913.5MeV/C^2
M.h = 2*Pi*H // 普朗克常數
M.Mu0 = 4*Pi*10e-7  // 真空磁導率
M.E0 =  1.0/(Mu0*C*C) // =8.854e-12  // 真空電容率

// 普朗克單位制
M.lP = 1.61625281e-35 // m, = sqrt(H*G/C^3) 普朗克長度
M.tP = lP/C // s, 普朗克時間
M.mP = H/(C*lP) // kg, 普朗克質量
M.TP = h/(kB*tP) // K, 普朗克溫度

