const ml6 = require('../../../js6/ml6')
const {game22} = ml6
// 參考 -- https://wiki.mbalib.com/zh-tw/%E5%8D%9A%E5%BC%88%E8%AE%BA
// ============== 囚徒困境矩陣 (坦白) =======================
//         p1 抵賴      p1 坦白
//        p0損 p1損    p0損 p1損
var P1 = [[[-1,  -1],  [-10,  0]],  // p0 抵賴
          [[ 0, -10],  [-8,  -8]]]  // p0 坦白

// ============== 囚徒合作矩陣 (抵賴) =======================
//         p1 抵賴      p1 坦白
//        p0損 p1損    p0損 p1損
var P2 = [[[ 0,   0],  [ -5, -5]],  // p0 抵賴
          [[-5,  -5],  [-10,-10]]]  // p0 坦白

// ======== 囚徒隨意矩陣 (未知: 初始信賴度是關鍵) ============
//         p1 抵賴      p1 坦白
//        p0損 p1損    p0損 p1損
var P3 = [[[ 0,   0],  [-8, -8]],  // p0 抵賴
          [[-8,  -8],  [-5, -5]]]  // p0 坦白

// ======== 智豬博弈矩陣 () ===========================
// https://zh.wikipedia.org/wiki/%E6%99%BA%E7%8C%AA%E5%8D%9A%E5%BC%88
//             按按鈕	     等待
//           p0益 p1益   p0益 p1益
var Pig1 = [[[ 5,  1],  [ 4,  4]],  // 按按鈕
            [[ 9, -1],  [ 0,  0]]]  // 等待

// ================ 零和遊戲 () ===========================
// https://en.wikipedia.org/wiki/Zero-sum_game
var ZeroSum1 = [[[ -1,  1],  [ 2,  -2]],
                [[ -2,  2],  [ 1,  -1]]]

// ================ 零和遊戲 () ===========================
var ZeroSum2 = [[[ -1,  1],  [ 2,  -2]],
                [[ -2,  2],  [ 5,  -5]]]

// ================ 合作駕駛 () ===========================
// https://en.wikipedia.org/wiki/Nash_equilibrium
var DriverGood = [[[ 10, 10],  [ 0,  0]],
                  [[  0,  0],  [10,  10]]]

game22({ep0:0.1, ep1:0.1, maxLoops:20, L:P1, name: "囚徒坦白"})
game22({ep0:0.9, ep1:0.9, maxLoops:20, L:P2, name: "囚徒抵賴"})
game22({ep0:0.3, ep1:0.3, maxLoops:20, L:P3, name: "囚徒有解：低信賴度"})
game22({ep0:0.8, ep1:0.8, maxLoops:20, L:P3, name: "囚徒有解：高信賴度"})
game22({ep0:0.5, ep1:0.5, maxLoops:20, L:Pig1, name: "智豬博弈：小豬等待，大豬去按"})
game22({ep0:0.5, ep1:0.5, maxLoops:50, L:ZeroSum1, name: "零和遊戲 1"})
game22({ep0:0.5, ep1:0.5, maxLoops:50, L:ZeroSum2, name: "零和遊戲 2"})
game22({ep0:0.6, ep1:0.5, maxLoops:50, L:DriverGood, name: "遵行方向駕駛"})